# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [50]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [51]:
s1 = pd.Series(np.random.randint(1, 4, size = 100))
s2 = pd.Series(np.random.randint(1, 3, size = 100))
s3 = pd.Series(np.random.randint(10000, 30000, size = 100))

In [52]:
s1

0     1
1     2
2     2
3     3
4     3
     ..
95    1
96    1
97    3
98    3
99    3
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [53]:
df = pd.concat([s1, s2, s3], axis = 1)
df

    0  1      2
0   1  1  15973
1   2  2  19218
2   2  2  23681
3   3  1  11098
4   3  1  16553
.. .. ..    ...
95  1  2  17773
96  1  1  22826
97  3  2  15460
98  3  1  13469
99  3  2  13709

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [54]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            15973
1      2       2            19218
2      2       2            23681
3      3       1            11098
4      3       1            16553

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [55]:
df['bigcolumn'] = s1.map(lambda x: str(x)) + '_' + s2.map(lambda x: str(x)) + '_' + s3.map(lambda x: str(x))
df

    bedrs  bathrs  price_sqr_meter  bigcolumn
0       1       1            15973  1_1_15973
1       2       2            19218  2_2_19218
2       2       2            23681  2_2_23681
3       3       1            11098  3_1_11098
4       3       1            16553  3_1_16553
..    ...     ...              ...        ...
95      1       2            17773  1_2_17773
96      1       1            22826  1_1_22826
97      3       2            15460  3_2_15460
98      3       1            13469  3_1_13469
99      3       2            13709  3_2_13709

[100 rows x 4 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
#Â Yep

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [49]:
df = df.append(df.reindex(range(100, 299)))
df

     bedrs  bathrs  price_sqr_meter  bigcolumn
0      1.0     2.0          26233.0  1_2_26233
1      3.0     2.0          10623.0  3_2_10623
2      3.0     1.0          21208.0  3_1_21208
3      1.0     2.0          13460.0  1_2_13460
4      3.0     1.0          13408.0  3_1_13408
..     ...     ...              ...        ...
294    NaN     NaN              NaN        NaN
295    NaN     NaN              NaN        NaN
296    NaN     NaN              NaN        NaN
297    NaN     NaN              NaN        NaN
298    NaN     NaN              NaN        NaN

[498 rows x 4 columns]